# Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

your_name = input('What is your name? - ')
your_birth_year = int(input('What year were you born in? - '))
print(f'So, you are {your_name} and you are {2019 - your_birth_year} years old. Nice to meet you!')

birth_year = 1987
age = 2019 - birth_year
name = 'Alexey'
print(f"And I'm {name}, {age} years old")

# Задание можно выполнять бесконечно. К сожалению, с фантазией туго,
# но думаю тему создания переменных, присвоения им значений,
# запроса значений у пользователя и вывода всего этого на экран я понял.